{
    "1": {
        "rca": "2",
        "short_term_fix": "3",
        "long_term_fix": "4",
        "remarks": "5",
        "spoc": "Sandeep Ghosh"
    },
    "#91706: High Offset Lag in UpdateWac Consumer": {
        "rca": "High offset lag due to increased message production or consumer slowdown caused by unoptimized processing or insufficient consumer instances.",
        "short_term_fix": "Check consumer logs for bottlenecks.",
        "long_term_fix": "Scale up consumer group, align message production rate with consumer capacity, and optimize message handling logic.",
        "remarks": "NA",
        "spoc": "Sandeep Ghosh"
    },
    "#91618: High CpuUser Percentage in Kafka Broker 6": {
        "rca": "High CPU usage due to resource-intensive operations on Kafka Broker 6, such as high request volume or inefficient partition configurations.",
        "short_term_fix": "Identify resource-intensive tasks in broker logs.",
        "long_term_fix": "Optimize partition assignments, add or redistribute brokers to balance load, and monitor for recurring CPU spikes.",
        "remarks": "NA",
        "spoc": "Sandeep ghosh"
    },
    "#91541: High Offset Lag in UpdateWac Consumer": {
        "rca": "High offset lag due to increased message production or consumer slowdown caused by unoptimized processing or insufficient consumer instances.",
        "short_term_fix": "Check consumer logs for bottlenecks.",
        "long_term_fix": "Scale up consumer group, align message production rate with consumer capacity, and optimize message handling logic.",
        "remarks": "",
        "spoc": ""
    },
    "#91421: SAP High Latency in Create SKU (> 20 seconds)": {
        "rca": "High latency caused by inefficient API queries, bottlenecks in backend services, or large payloads being processed in the create SKU function.",
        "short_term_fix": "Trace slow requests using APM tools.",
        "long_term_fix": "Optimize API queries and reduce payload size, ensure backend services are scaled and responsive.",
        "remarks": "",
        "spoc": ""
    },
    "#91380: Elastic Cache: High Replication Lag in prod-zepto-redi": {
        "rca": "Replication lag due to write-heavy workload or insufficiently provisioned replication nodes.",
        "short_term_fix": "Increase replication node capacity.",
        "long_term_fix": "Monitor write operation patterns and optimize, enable Redis clustering, and perform a health check on replication configuration.",
        "remarks": "",
        "spoc": ""
    },
    "#91378: High Offset Lag in UpdateWac Consumer": {
        "rca": "Replication lag due to write-heavy workload or insufficiently provisioned replication nodes.",
        "short_term_fix": "Identify resource-intensive tasks in broker logs.",
        "long_term_fix": "Optimize partition assignments, add or redistribute brokers to balance load, and monitor for recurring CPU spikes.",
        "remarks": "",
        "spoc": ""
    },
    "#88850: Low Cache Hit Rate in Invoice-Processing-Service Cluster": {
        "rca": "High cache miss rate due to poor caching strategy or excessive cache invalidations.",
        "short_term_fix": "Analyze caching strategy and optimize key utilization.",
        "long_term_fix": "Monitor cache eviction and adjust cache TTL, scale cache cluster if needed.",
        "remarks": "",
        "spoc": ""
    },
    "Unable to generate the document of recirculation": {
        "rca": "The outbound corresponding to this inbound is not found. The issue occurs due to the current WAC model not properly supporting SS and recirculation.",
        "short_term_fix": "Migrate to the new WAC model.",
        "long_term_fix": "The new WAC model will support SS and recirculation properly, eliminating this issue.",
        "remarks": "",
        "spoc": ""
    },
    "SS document generation issue raised by ground team": {
        "rca": "Incorrect or missing information on SS document due to wrong GSTIN entered.",
        "short_term_fix": "Correct GSTIN: Ensure the correct GSTIN is entered for the buyer.",
        "long_term_fix": "Retry the document generation process.",
        "remarks": "",
        "spoc": "@engg_support"
    },
    "Document generation issue - tax mapping failure": {
        "rca": "Tax mapping for SKU is not valid or missing for some cases.",
        "short_term_fix": "Ensure that the tax mapping is properly configured and aligned with the price at which the event is created.",
        "long_term_fix": "Upload the corrected data for the SKU.",
        "remarks": "",
        "spoc": "Thor_on_call"
    },
    "Document generation issue due to tax mapping failure": {
        "rca": "Tax product variant mapping and tax code range did not match the event's price.",
        "short_term_fix": "Ensure the tax mapping is updated with the correct tax codes and variant IDs for all relevant SKUs.",
        "long_term_fix": "Validate and upload the correct data to resolve the issue.",
        "remarks": "",
        "spoc": "Sandeep"
    },
    "Document generation failed due to special characters in remarks": {
        "rca": "Special characters in the remarks field caused an invalid delivery number.",
        "short_term_fix": "Re-trigger the API call with corrected remarks without special characters.",
        "long_term_fix": "Mark the original delivery number as invalid (-F) and retry document generation.",
        "remarks": "",
        "spoc": "Sandeep"
    },
    "Document generation failure due to incorrect DH store pincode": {
        "rca": "Incorrect DH store pincode did not match the state code, causing an error in ClearTax.",
        "short_term_fix": "Correct the pincode in the backend.",
        "long_term_fix": "Mark the old document number as invalid (-F) and retry document generation.",
        "remarks": "",
        "spoc": "@Finance_on_call"
    },
    "Unable to generate tax mapping file for output": {
        "rca": "This issue is caused due to misalignment in the tax product variant mapping.",
        "short_term_fix": "Update the tax mapping files correctly.",
        "long_term_fix": "Fix the mapping issues and adjust file generation accordingly.",
        "remarks": "",
        "spoc": "Radhika"
    },
    "Unable to generate secondary sales documents due to invalid assessable amount": {
        "rca": "The error occurred because the SKUs' price was lower than the cess absolute, which caused the secondary sales document generation to fail.",
        "short_term_fix": "Cancel the affected secondary sales documents. A new CSV file with the eligible cost price for every SKU must be prepared and re-uploaded for the secondary sales (SS) documents to be dispatched. Solution to be executed by",
        "long_term_fix": "",
        "remarks": "",
        "spoc": "@Mohit Gupta and @Mohit Kori."
    },
    "Document generation failed due to incorrect HSN Code": {
        "rca": "The failure occurred because an incorrect HSN code was used in the document generation process",
        "short_term_fix": "Update the correct HSN code and retry document generation. Solution to be executed by @Radhika Poojari.",
        "long_term_fix": "",
        "remarks": "",
        "spoc": ""
    },
    "Document generation failure due to invalid pin code mapping (NIC response error)": {
        "rca": "The error was caused by an invalid pin code (1210004) in the buyer details, which did not match the correct state code (06) as per the NIC master list.",
        "short_term_fix": "Update the correct pin code for this location, revalidate the state-code mapping, and retry document generation",
        "long_term_fix": "",
        "remarks": "",
        "spoc": "engg-support."
    }
}